# Pandas

In [3]:
import pandas as pd
import numpy as np

## Series
Fixed-length, ordered dict

In [4]:
obj = pd.Series([4, 7, -5, 3], index=['one', 'two', 'three', 'four'])
obj

one      4
two      7
three   -5
four     3
dtype: int64

In [5]:
obj.to_dict()

{'one': 4, 'two': 7, 'three': -5, 'four': 3}

In [6]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3.name = 'population'
obj3.index.name = 'state'
obj3

state
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
Name: population, dtype: int64

## DataFrame
Table of data, each column can have a different type

In [7]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four', 'five', 'six'])
frame

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

Per accedere alle colonne

In [8]:
# frame['state'] equivalente
#frame.state
frame.iloc[:, 1]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

Per accedere alle righe

In [9]:
# frame.loc['three'] equivalente
frame.iloc[2, :]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

### Drop

In [10]:
frame.drop(['one', 'two'])

       year   state  pop debt
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [11]:
frame.drop(['year', 'state'], axis =1)

       pop debt
one    1.5  NaN
two    1.7  NaN
three  3.6  NaN
four   2.4  NaN
five   2.9  NaN
six    3.2  NaN

### Function application

In [12]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.230510 -0.288617  0.215076
Ohio    0.064221 -0.003111 -0.660003
Texas   1.259961  1.395845 -1.211058
Oregon  0.355417 -0.411285  0.334460

In [13]:
def max_min(x):
    return x.max()-x.min()
frame.apply(max_min) # axis = 1 per farlo sulle righe

b    1.490471
d    1.807130
e    1.545518
dtype: float64

In [14]:
frame.apply(lambda x : x.max() - x.min())

b    1.490471
d    1.807130
e    1.545518
dtype: float64

# Data Managing

In [21]:
df = pd.read_csv("../3-Pandas/data/ex1.csv", sep=',')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [28]:
names=['a', 'b', 'c', 'd', 'message']
df = pd.read_csv("../3-Pandas/data/ex2.csv", names=names, index_col=-1)
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

## Handling Missing Data

In [38]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[4:, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -0.745018 -1.537564       NaN
1 -0.678279 -0.268539       NaN
2 -0.125661 -1.092878 -1.035972
3  0.139951  0.974123  0.598656
4 -0.008442       NaN -1.071272
5 -0.288029       NaN -0.144397
6  0.020019       NaN  0.642735

In [32]:
df.dropna() # axis =1

          0
0  0.727626
1 -0.217990
2  1.360497
3  0.297745
4  0.815819
5 -0.213635
6  0.879327

In [34]:
df.dropna(thresh=2)

          0         1         2
2  1.360497       NaN  1.187028
3  0.297745       NaN -1.187033
4  0.815819  0.577406 -0.008573
5 -0.213635 -0.483508 -0.002852
6  0.879327 -0.181652 -0.676164

In [36]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.727626  0.500000  0.000000
1 -0.217990  0.500000  0.000000
2  1.360497  0.500000  1.187028
3  0.297745  0.500000 -1.187033
4  0.815819  0.577406 -0.008573
5 -0.213635 -0.483508 -0.002852
6  0.879327 -0.181652 -0.676164

In [40]:
df.fillna(method='ffill', limit=2) #prende il valore dalla cella sopra
#con limit dico per quante celle vale ancora quel valore

/var/folders/d5/jd8cs2ds0lq81wp6tr68x7800000gn/T/ipykernel_76013/254206660.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2) #prende il valore dalla cella sopra

          0         1         2
0 -0.745018 -1.537564       NaN
1 -0.678279 -0.268539       NaN
2 -0.125661 -1.092878 -1.035972
3  0.139951  0.974123  0.598656
4 -0.008442  0.974123 -1.071272
5 -0.288029  0.974123 -0.144397
6  0.020019       NaN  0.642735

### Mapping

In [43]:
data = pd.DataFrame({
    'device': ['iPhone', 'Galaxy S21', 'MacBook Pro', 'Pixel 6',
               'ThinkPad', 'iPad', 'Surface Pro', 'galaxy tab', 'Macbook air'],
    'price': [999, 799, 1299, 599, 1099, 799, 999, 649, 999]
})
data

        device  price
0       iPhone    999
1   Galaxy S21    799
2  MacBook Pro   1299
3      Pixel 6    599
4     ThinkPad   1099
5         iPad    799
6  Surface Pro    999
7   galaxy tab    649
8  Macbook air    999

In [44]:

device_to_brand = {
    'iphone': 'Apple',
    'macbook pro': 'Apple',
    'macbook air': 'Apple',
    'ipad': 'Apple',
    'galaxy s21': 'Samsung',
    'galaxy tab': 'Samsung',
    'pixel 6': 'Google',
    'thinkpad': 'Lenovo',
    'surface pro': 'Microsoft'
}
data['brand'] = data['device'].str.lower().map(device_to_brand)
data

        device  price      brand
0       iPhone    999      Apple
1   Galaxy S21    799    Samsung
2  MacBook Pro   1299      Apple
3      Pixel 6    599     Google
4     ThinkPad   1099     Lenovo
5         iPad    799      Apple
6  Surface Pro    999  Microsoft
7   galaxy tab    649    Samsung
8  Macbook air    999      Apple

### Binning

In [47]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 59, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

values = pd.cut(ages, bins, labels=group_names)
#pd.cut(ages, [18, 26, 36, 61, 100], right=False) right=False for ) instad of ]

values

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'MiddleAged', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [48]:
pd.value_counts(values)

/var/folders/d5/jd8cs2ds0lq81wp6tr68x7800000gn/T/ipykernel_76013/1242900332.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

Youth         5
MiddleAged    4
YoungAdult    3
Senior        0
Name: count, dtype: int64

### Grouping

In [60]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.729068 -0.549258
1    a  two -0.242254  0.114818
2    b  one  0.223967  0.878671
3    b  two  0.230390  0.311698
4    a  one  2.493922 -0.495942

In [53]:
grouped = df['data1'].groupby(df['key1']) #su grouped posso fare delle funzioni
grouped.max()

key1
a    0.427001
b    2.061049
Name: data1, dtype: float64

In [54]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)
    print("\n\n")

a
  key1 key2     data1     data2
0    a  one  0.427001  0.281511
1    a  two -1.132392 -1.415274
4    a  one -1.946697  1.098221



b
  key1 key2     data1     data2
2    b  one  2.061049 -0.972478
3    b  two  0.406257 -0.388843

In [62]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe    -0.321554 -1.752155  1.296070  1.378775  0.070505
Steve  -0.086858 -1.616633  0.632213 -0.729612 -0.030196
Wes     0.893024  0.415699 -1.101487 -0.058562 -2.225767
Jim     0.161274  1.098999  0.044846 -1.012671  0.050251
Travis -0.292947 -1.823765 -0.144499  1.140750  1.799630

In [66]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'orange'}
by_column = people.groupby(mapping, axis=1)
by_column.sum()

/var/folders/d5/jd8cs2ds0lq81wp6tr68x7800000gn/T/ipykernel_76013/2970750620.py:3: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  by_column = people.groupby(mapping, axis=1)

            blue    orange       red
Joe     2.674846  0.070505 -2.073709
Steve  -0.097399 -0.030196 -1.703490
Wes    -1.160050 -2.225767  1.308723
Jim    -0.967825  0.050251  1.260273
Travis  0.996251  1.799630 -2.116711

In [74]:
tips = pd.read_csv('../4-Pandas_advanced/tips.csv')
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips.head(5)

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [77]:
grouped = tips.groupby(['day', 'smoker'])
grouped_pct = grouped['tip_pct']
grouped_pct.agg(['mean', 'std'])

                 mean       std
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

## Pivot Tables

In [78]:
tips = pd.read_csv('../4-Pandas_advanced/tips.csv')
tips.head(5)

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

In [82]:
tips.pivot_table(index=['day', 'smoker'], values='tip', aggfunc='sum')

                tip
day  smoker
Fri  No       11.25
     Yes      40.71
Sat  No      139.63
     Yes     120.77
Sun  No      180.57
     Yes      66.82
Thur No      120.32
     Yes      51.51